emauriciorg/msp430/theimperialmarch/main.c
#include <msp430g2553.h>
#define ledPin  BIT6;

unsigned char speakerPin=  BIT2;

//speaker connected to one of the PWM ports

#define c 261
#define d 294
#define e 329
#define f 349
#define g 391
#define gS 415
#define a 440
#define aS 455
#define b 466
#define cH 523
#define cSH 554
#define dH 587
#define dSH 622
#define eH 659
#define fH 698
#define fSH 740
#define gH 784
#define gSH 830
#define aH 880
//frequencies for the tones we're going to use
//used http://home.mit.bme.hu/~bako/tonecalc/tonecalc.htm to get these




int x;
char SerOk=0;
unsigned int delayAmount = 0;

long loopTime = 0;


void enable_interrupts(){

	_BIS_SR(GIE);
		 			__enable_interrupt();
		 			__bis_SR_register(GIE);

}

void delay_mio(unsigned int nmicros){



	   TACTL	 = ID_3|TASSEL_2|MC_1; //UP mode
	   TACCR0	 = nmicros;
	   TACCTL0 =OUTMOD_7;
	   TACCR1=0;
	 	enable_interrupts();

	 do{

		while((TACCTL0&CCIFG)!=CCIFG);

		TACCTL0&=~CCIFG;



    SerOk++;

	 }while(SerOk!=2);

		TACCTL0|=TACLR;
		SerOk=0;
		__disable_interrupt();


}


void beep(unsigned char speakerPin, int frequencyInHertz, long timeInMilliseconds)
{
    P1OUT|=ledPin;


     delayAmount =  (1000000/frequencyInHertz);

    loopTime = (long)((timeInMilliseconds*1000)/(delayAmount*2));


    for (x=0;x<loopTime;x++)
    {
        P2OUT|=speakerPin;
       delay_mio(delayAmount);

        P2OUT&=~speakerPin;
        delay_mio(delayAmount);
    }

    P1OUT&=~ledPin;
    //set led back to low

    _delay_cycles(20000);//delay(20)
    //a little delay to make all notes sound separate
}

void march()
{
    //for the sheet music see:
    //http://www.musicnotes.com/sheetmusic/mtd.asp?ppn=MN0016254
    //this is just a translation of said sheet music to frequencies / time in ms
    //used 500 ms for a quart note

    beep(speakerPin, a, 500);
    beep(speakerPin, a, 500);
    beep(speakerPin, a, 500);
    beep(speakerPin, f, 350);
    beep(speakerPin, cH, 150);

    beep(speakerPin, a, 500);
    beep(speakerPin, f, 350);
    beep(speakerPin, cH, 150);
    beep(speakerPin, a, 1000);
    //first bit

    beep(speakerPin, eH, 500);
    beep(speakerPin, eH, 500);
    beep(speakerPin, eH, 500);
    beep(speakerPin, fH, 350);
    beep(speakerPin, cH, 150);

    beep(speakerPin, gS, 500);
    beep(speakerPin, f, 350);
    beep(speakerPin, cH, 150);
    beep(speakerPin, a, 1000);
    //second bit...

    beep(speakerPin, aH, 500);
    beep(speakerPin, a, 350);
    beep(speakerPin, a, 150);
    beep(speakerPin, aH, 500);
    beep(speakerPin, gSH, 250);
    beep(speakerPin, gH, 250);

    beep(speakerPin, fSH, 125);
    beep(speakerPin, fH, 125);
    beep(speakerPin, fSH, 250);
    _delay_cycles(250000);
    beep(speakerPin, aS, 250);
    beep(speakerPin, dSH, 500);
    beep(speakerPin, dH, 250);
    beep(speakerPin, cSH, 250);
    //start of the interesting bit

    beep(speakerPin, cH, 125);
    beep(speakerPin, b, 125);
    beep(speakerPin, cH, 250);
    _delay_cycles(250000);
    beep(speakerPin, f, 125);
    beep(speakerPin, gS, 500);
    beep(speakerPin, f, 375);
    beep(speakerPin, a, 125);

    beep(speakerPin, cH, 500);
    beep(speakerPin, a, 375);
    beep(speakerPin, cH, 125);
    beep(speakerPin, eH, 1000);
    //more interesting stuff (this doesn't quite get it right somehow)

    beep(speakerPin, aH, 500);
    beep(speakerPin, a, 350);
    beep(speakerPin, a, 150);
    beep(speakerPin, aH, 500);
    beep(speakerPin, gSH, 250);
    beep(speakerPin, gH, 250);

    beep(speakerPin, fSH, 125);
    beep(speakerPin, fH, 125);
    beep(speakerPin, fSH, 250);
    _delay_cycles(250000);
    beep(speakerPin, aS, 250);
    beep(speakerPin, dSH, 500);
    beep(speakerPin, dH, 250);
    beep(speakerPin, cSH, 250);
    //repeat... repeat

    beep(speakerPin, cH, 125);
    beep(speakerPin, b, 125);
    beep(speakerPin, cH, 250);
    _delay_cycles(250000);
    beep(speakerPin, f, 250);
    beep(speakerPin, gS, 500);
    beep(speakerPin, f, 375);
    beep(speakerPin, cH, 125);

    beep(speakerPin, a, 500);
    beep(speakerPin, f, 375);
    beep(speakerPin, c, 125);
    beep(speakerPin, a, 1000);
    //and we're done \�/
}
//http://home.mit.bme.hu/~bako/tonecalc/tonecalc.htm
int main( void )
{
    WDTCTL = WDTPW | WDTHOLD;
	BCSCTL1 =CALBC1_16MHZ;
	BCSCTL2 =0;
	DCOCTL = CALDCO_16MHZ;

    P2DIR|=speakerPin;              // P2.2 output
    P1DIR|=ledPin;              // P2.2 output
    P1SEL=0;              // P2.2 output
    P1SEL2=0;
    P2SEL=0;
    P2SEL2=0;
    while(1)
    {
    	  march();

    }
}
